# Поток событий для прецедента "Регистрация аккаунта"
## Основной поток
 1. Вариант использования начинается, когда пользователь, войдя в приложение,
	     нажимает на кнопку "Создать аккаунт".
  2. Приложение показывает поля для заполнения формы регистрации.
  3. Пользователь заполняет поля регистрации.
  4. Приложение отправляет запрос в базу данных, на создание нового аккаунта.
  5. Вариант использование завершается.
# Поток событий для прецедента "Добавить лекарственное средство"
## Основной поток
  1. Пользователь должен быть автроризирован.
  2. Приложение открывает экран добавления лекарственного средства.
  3. Пользователь вводит название лекарственного средства, кол-во таблеток за 1 прием, кол-во таблеток.
  4. Приложение добавляет задачу в базу данных и оповещения.
  5. Приложение обновляет список лекарственных средств.
  6. Вариант использование завершается.
# Поток событий для прецедента "Удалить лекарственное средство"
## Основной поток
  1. Пользователь должен быть автроризирован.
  2. Приложение открывает экран со списком лекарственных средств.
  3. Пользователь делает свайп влево для отображение кнопки Delete.
  4. Пользователь нажимает на кнопку Delete, лекарственное средство удаляется из списка используемых и из базы данных.
  5. Приложение обновляет список лекарственных средств.
  6. Вариант использование завершается.
# Поток событий для прецедента "Вход в аккаунт пользователя"
## Основной поток
  1. Пользователь не должен быть автроризирован.
  2. Приложение открывает Home экран.
  3. Пользователь заполняет поля email и password.
  4. Пользователь нажимает на кнопку login.
  5. Приложение загружает информацию пользователя из базы данных.
  6. Вариант использование завершается.
